{
  "backend/main.mo": "Main actor defining song submission types (SongSubmission, TrackMetadata, PublicSongInfo) with status workflow, ACR integration, and includes MixinStorage for blob handling and migration support for adding spotifyLink and appleMusicLink fields.",
  "backend/migration.mo": "Migration module that transforms old SongSubmission records to new format by adding spotifyLink and appleMusicLink optional fields while preserving all existing data.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: public song pages with verification badges, admin manage links dialog, styled streaming platform buttons, and static platform logo assets.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including routing, query hooks for song info and link management, submission forms with artist profile selection, admin interfaces with manage links functionality, and verification badge components.",
  "frontend/DEPLOYMENT.md": "Deployment documentation explaining config.ts creation to fix missing configuration errors, enhanced error handling in useActor hook, and restoration of Draft Version 70 song submission workflow with verification steps.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with neutral grayscale palette and chart colors.",
  "frontend/index.html": "HTML entry point with page title 'INDIE TAMIL MUSIC PRODUCTION - Music Distribution Platform', favicon reference, and React root mounting point.",
  "frontend/src/App.tsx": "Main application entry point that sets up routing with TanStack Router, React Query, theme provider, and authentication state management. Renders layout with header/footer, handles profile setup modal, and shows loading states during initialization.",
  "frontend/src/components/AdminAnnouncementSection.tsx": "Empty file with no content.",
  "frontend/src/components/AdminArtistManagement.tsx": "Admin component for managing artist profiles with search functionality, displaying profile cards with contact info and social links, and providing edit/delete actions. Includes confirmation dialog for deletions and integrates with artist profile queries.",
  "frontend/src/components/AdminBlogManagement.tsx": "Empty file with no content.",
  "frontend/src/components/AdminEditArtistDialog.tsx": "Dialog component for editing artist profiles with form fields for personal info, social media links, and profile photo upload. Handles file upload with progress tracking and checkbox toggles for optional Spotify/Apple Music profiles.",
  "frontend/src/components/AdminEditSubmissionDialog.tsx": "Dialog for editing song submissions with fields for metadata (title, genre, release date), artist selection via checkboxes, file uploads for artwork/audio with progress tracking, and album track editor for multi-track releases. Matches artist names to profile IDs and handles validation.",
  "frontend/src/components/AdminEditVideoDialog.tsx": "Dialog component for editing video submissions with fields for title, description, category, tags, and file uploads for thumbnail, artwork, and video. Tracks upload progress for each file and validates required fields before saving.",
  "frontend/src/components/AdminFeeManagement.tsx": "Empty file with no content.",
  "frontend/src/components/AdminManageLinksDialog.tsx": "Dialog for managing streaming platform links (Spotify and Apple Music) for songs, with URL validation and display of public song link when status is live. Provides save functionality with error handling and toast notifications.",
  "frontend/src/components/AdminMonthlyListenersManagement.tsx": "Admin component for managing monthly listener statistics for live songs, allowing admins to add, update, and view historical listener data by month and year.",
  "frontend/src/components/AdminPodcastSubmissions.tsx": "Admin component for reviewing and moderating podcast show and episode submissions, with status management (pending/approved/rejected/live) and file download capabilities.",
  "frontend/src/components/AdminProfileEditingControl.tsx": "Empty file with no content.",
  "frontend/src/components/AdminStats.tsx": "Empty file with no content.",
  "frontend/src/components/AdminSubmissionsList.tsx": "Admin component for managing song submissions with status updates, live URL assignment, admin remarks/comments, editing, link management, and deletion capabilities.",
  "frontend/src/components/AdminSubscriptionPlansManagement.tsx": "Admin component for creating, editing, and deleting subscription plans with fields for plan name, price per year, benefits list, and redirect URL.",
  "frontend/src/components/AdminSupportRequestsManagement.tsx": "Empty file with no content.",
  "frontend/src/components/AdminTeamManagement.tsx": "Admin component for generating and managing invite codes for team members, with copy-to-clipboard functionality for invite links.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin component for managing users with search/filter capabilities, blocking/unblocking song and podcast submissions, and updating user categories (general/pro/ultra artist, general/pro label).",
  "frontend/src/components/AdminUserRoleManagement.tsx": "Empty file with no content.",
  "frontend/src/components/AdminVerificationList.tsx": "Admin component for managing artist verification requests with approve/reject/extend actions, status badges, and user profile lookups.",
  "frontend/src/components/AdminVerificationManagement.tsx": "Empty file, no content.",
  "frontend/src/components/AdminVerificationRequests.tsx": "Empty file, no content.",
  "frontend/src/components/AdminVideoSubmissions.tsx": "Admin component for managing video submissions with status updates, download, edit, delete functionality, and live URL assignment.",
  "frontend/src/components/AlbumTracksEditor.tsx": "Editor component for managing album tracks with metadata fields (title, artist, composer, etc.) and audio file upload with progress tracking.",
  "frontend/src/components/AnnouncementPopup.tsx": "Empty file, no content.",
  "frontend/src/components/ArtistNameWithVerified.tsx": "Component that displays an artist name with either a verified badge or green badge based on verification status.",
  "frontend/src/components/ArtistProfilesCheckboxSelector.tsx": "Reusable checkbox selector component for selecting multiple artist profiles from a scrollable list.",
  "frontend/src/components/ArtistSetupForm.tsx": "Form component for creating or editing artist profiles with personal info, social links, profile photo upload, and conditional editing restrictions.",
  "frontend/src/components/ClaimYouTubeCopyrightDialog.tsx": "Empty file, no content.",
  "frontend/src/components/ConnectInstagramProfileDialog.tsx": "Empty file, no content.",
  "frontend/src/components/DashboardPublishedBlogList.tsx": "Empty file, no content.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and support email contact information.",
  "frontend/src/components/GeneralSupportTab.tsx": "Empty file, no content.",
  "frontend/src/components/GreenBadge.tsx": "Component that displays a green tick badge icon with tooltip indicating 'Artist' status.",
  "frontend/src/components/Header.tsx": "Header component with app title, theme toggle, authentication button, and displays logged-in artist profile with verification badge.",
  "frontend/src/components/PodcastEpisodeForm.tsx": "Form component for creating podcast episodes with file uploads (thumbnail, artwork, media), metadata fields (title, description, season/episode numbers), and submission blocking logic based on user limits.",
  "frontend/src/components/PodcastShowForm.tsx": "Form component for creating podcast shows with fields for title, description, type, category, language, and artwork upload, including submission blocking checks.",
  "frontend/src/components/PricingSection.tsx": "Displays subscription plans in a grid layout with pricing, benefits list, and external redirect buttons for plan selection.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for first-time users to set up their profile by entering their name and selecting a user category.",
  "frontend/src/components/SongSubmissionForm.tsx": "Comprehensive song submission form with metadata fields, artist selection, file uploads (artwork with 3000×3000 validation, audio), album track editor, and submission blocking logic.",
  "frontend/src/components/StreamingPlatformButton.tsx": "Reusable button component for linking to streaming platforms (Spotify, Apple Music) with platform-specific styling and logos.",
  "frontend/src/components/StripeConfigurationModal.tsx": "Empty file with no content.",
  "frontend/src/components/SubscriptionSection.tsx": "Empty file with no content.",
  "frontend/src/components/SupportRequestsList.tsx": "Empty file with no content.",
  "frontend/src/components/UserAnalysisPanel.tsx": "Dashboard component displaying monthly listener statistics for live songs, showing historical data sorted by year and month with empty states for songs without stats.",
  "frontend/src/components/UserArtistProfilesManager.tsx": "Manages user's artist profiles with CRUD operations, displaying profile cards with contact info, social links, and streaming platform connections. Includes dialogs for creating, editing, and deleting artist profiles.",
  "frontend/src/components/UserEditSubmissionDialog.tsx": "Dialog component for editing song submissions with form fields for metadata (title, genre, release date, etc.), artist selection via checkboxes, file uploads for artwork/audio with progress tracking, and album track management.",
  "frontend/src/components/UserEditVideoDialog.tsx": "Dialog for editing video submissions with fields for title, description, category, tags, and file uploads (thumbnail, artwork, video) with progress tracking and validation.",
  "frontend/src/components/UserPodcastSubmissionSection.tsx": "Tabbed interface for managing podcast shows and episodes, displaying user's shows with moderation status badges, expandable episode lists, and forms for creating new shows or adding episodes.",
  "frontend/src/components/UserSubmissionsList.tsx": "Displays list of user's song submissions with artwork thumbnails, metadata, status badges (draft/pending/approved/live), and edit functionality for draft/pending/rejected submissions.",
  "frontend/src/components/UserVideoSubmissionSection.tsx": "Displays a list of user's video submissions with status badges, thumbnails, and edit functionality for pending/rejected videos. Includes a dialog for editing video details and shows loading/empty states.",
  "frontend/src/components/VerificationBenefitsPopup.tsx": "Empty file with no content.",
  "frontend/src/components/VerificationBenefitsSection.tsx": "Displays a promotional card encouraging users to become verified artists for ₹200/month, listing benefits like blue badge, priority distribution, faster approval, and premium support. Hidden for already-verified users.",
  "frontend/src/components/VerificationPromotionPopup.tsx": "Empty file with no content.",
  "frontend/src/components/VerificationRenewalSection.tsx": "Shows an alert card for users with expired verified artist status, listing missed benefits and providing a renewal button. Only visible to non-verified users.",
  "frontend/src/components/VerifiedBadge.tsx": "Renders a blue verification badge image with tooltip in small, medium, or large sizes, indicating verified artist or pro user status.",
  "frontend/src/components/VideoSubmissionForm.tsx": "Form component for submitting video content with fields for title, description, category, tags, and file uploads (thumbnail, artwork, video). Includes upload progress tracking and navigates to thank-you page on success.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, song info, streaming links, and various submission types (songs, podcasts, videos). Includes mutations for creating, updating, and deleting entities with query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, primary/secondary colors, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabs for managing artists, song submissions, podcasts, videos, verification lists, monthly listeners, users, and subscription plans.",
  "frontend/src/pages/BlogPage.tsx": "Empty file placeholder for blog page functionality.",
  "frontend/src/pages/BlogPostPage.tsx": "Empty file placeholder for individual blog post page functionality.",
  "frontend/src/pages/CommunityPage.tsx": "Empty file placeholder for community page functionality.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero section, features showcase, and pricing section. Handles authentication and redirects users to admin or user dashboard based on role.",
  "frontend/src/pages/PaymentCancel.tsx": "Empty file placeholder for payment cancellation page.",
  "frontend/src/pages/PaymentSuccess.tsx": "Empty file placeholder for payment success page.",
  "frontend/src/pages/SongPage.tsx": "Public song detail page displaying artwork, title, artist info, and streaming platform links (Spotify, Apple Music) for a specific song ID.",
  "frontend/src/pages/TeamDashboard.tsx": "Empty file placeholder for team dashboard functionality.",
  "frontend/src/pages/ThankYouPage.tsx": "Confirmation page displayed after successful song submission with a success message and button to return to user dashboard.",
  "frontend/src/pages/UserDashboard.tsx": "User dashboard with tabs for managing artist profiles, submitting songs/videos, viewing submissions, podcast management, and analytics.",
  "frontend/src/pages/VerificationSubscriptionPage.tsx": "Empty file placeholder for verification subscription page.",
  "frontend/src/utils/downloadExternalBlob.ts": "Utility function to download an ExternalBlob by fetching bytes, creating a browser Blob, and triggering a download with specified filename.",
  "frontend/src/utils/fileToExternalBlob.ts": "Converts browser File or Blob to ExternalBlob for backend upload, with optional progress tracking callback.",
  "frontend/src/utils/isValidUrl.ts": "Validates that a URL string is non-empty and starts with http:// or https://.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme for sidebar/chart/card components, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking for a music platform with link-in-bio feature, documenting existing features for public song pages with streaming platform links, pending admin approval workflow, and requirements for platform logo assets."
}