{
  "backend/main.mo": "Main actor module that includes MixinStorage and defines core types (SongStatus, SongSubmission, TrackMetadata, ACRResult, PreSave) and input types for song submission, editing, and retrieval operations.",
  "feature_evidence.json": "Feature evidence report documenting the admin subscription plan management interface feature with high confidence, listing associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components for song/video/podcast submissions, admin dashboards, artist profiles, verification badges, team management, and authentication flows.",
  "frontend/DEPLOYMENT.md": "Deployment documentation explaining the fix for missing config.ts file, configuration loading mechanisms, error handling improvements, and restoration of Draft Version 70 song submission workflow.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining CSS variables for light and dark themes with purple/pink/blue gradient color scheme.",
  "frontend/index.html": "HTML entry point with page title 'INDIE TAMIL MUSIC PRODUCTION - Music Distribution Platform', favicon reference, and root div for React mounting.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup (routes: /, /user-dashboard, /admin-dashboard, /thank-you), authentication state management, actor initialization checks, profile setup modal, and theme provider.",
  "frontend/src/components/AdminAnnouncementSection.tsx": "Empty component file for admin announcement functionality.",
  "frontend/src/components/AdminArtistManagement.tsx": "Admin interface for managing artist profiles with search functionality, profile display with verified badges, edit/delete actions, and team member access control.",
  "frontend/src/components/AdminBlogManagement.tsx": "Empty component file for admin blog management functionality.",
  "frontend/src/components/AdminEditArtistDialog.tsx": "Dialog component for admins to edit artist profiles, including personal info, social links, and profile photo upload with progress tracking.",
  "frontend/src/components/AdminEditSubmissionDialog.tsx": "Dialog component for admins to edit song submissions with fields for metadata, artist selection, album tracks, and file uploads (artwork/audio) with progress tracking.",
  "frontend/src/components/AdminEditVideoDialog.tsx": "Dialog component for admins to edit video submissions including title, description, category, tags, and file uploads (thumbnail, artwork, video) with progress tracking.",
  "frontend/src/components/AdminFeeManagement.tsx": "Empty file with no content.",
  "frontend/src/components/AdminMonthlyListenersManagement.tsx": "Component for admins to manage monthly listener statistics for live songs, allowing entry of listener counts by month/year and displaying existing stats.",
  "frontend/src/components/AdminPodcastSubmissions.tsx": "Component for admins to review and moderate podcast shows and episodes, with status management (pending/approved/rejected/live) and file download capabilities.",
  "frontend/src/components/AdminProfileEditingControl.tsx": "Empty file with no content.",
  "frontend/src/components/AdminStats.tsx": "Empty file with no content.",
  "frontend/src/components/AdminSubmissionsList.tsx": "Admin component for managing song submissions with filtering, status updates, live URL setting, editing, deletion, and file downloads. Includes sorting logic to prioritize Pro users and verified artist badge display.",
  "frontend/src/components/AdminSubscriptionPlansManagement.tsx": "Admin interface for creating, editing, and deleting subscription plans with fields for plan name, price per year, benefits list, and redirect URL. Uses dialogs and alert dialogs for CRUD operations.",
  "frontend/src/components/AdminSupportRequestsManagement.tsx": "Empty file with no content.",
  "frontend/src/components/AdminTeamManagement.tsx": "Admin component for generating and managing invite codes for team members, with copy-to-clipboard functionality for invite links and display of unused codes.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin interface for managing users with search, category filtering, blocking/unblocking song and podcast submissions, and updating user categories (General/Pro/Ultra Artist, General/Pro Label).",
  "frontend/src/components/AdminUserRoleManagement.tsx": "Empty file with no content.",
  "frontend/src/components/AdminVerificationList.tsx": "Admin component displaying verification requests with status badges (pending, approved, rejected, waiting), allowing approval, rejection, and expiry extension with configurable days.",
  "frontend/src/components/AdminVerificationManagement.tsx": "Empty file with no content.",
  "frontend/src/components/AdminVerificationRequests.tsx": "Empty file with no content.",
  "frontend/src/components/AdminVideoSubmissions.tsx": "Admin component for managing video submissions with status filtering, status updates (including live URL setting), video downloads, editing via dialog, and deletion with confirmation.",
  "frontend/src/components/AlbumTracksEditor.tsx": "A React component for managing album tracks with fields for metadata (title, artist, composer, etc.) and audio file uploads with progress tracking. Supports adding, removing, and updating individual tracks.",
  "frontend/src/components/AnnouncementPopup.tsx": "Empty file with no content.",
  "frontend/src/components/ArtistNameWithVerified.tsx": "Displays an artist name with a verification badge (verified or green badge) based on the artist's verification status fetched via a query hook.",
  "frontend/src/components/ArtistProfilesCheckboxSelector.tsx": "A checkbox list component for selecting multiple artist profiles from a list, with optional helper text and required field support.",
  "frontend/src/components/ArtistSetupForm.tsx": "A form component for creating or editing artist profiles with fields for personal info, social links, and profile photo upload. Includes editing access control and approval status checks.",
  "frontend/src/components/ClaimYouTubeCopyrightDialog.tsx": "Empty file with no content.",
  "frontend/src/components/ConnectInstagramProfileDialog.tsx": "Empty file with no content.",
  "frontend/src/components/DashboardPublishedBlogList.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "A footer component displaying copyright information and a contact email address with responsive layout.",
  "frontend/src/components/GeneralSupportTab.tsx": "Empty file with no content.",
  "frontend/src/components/GreenBadge.tsx": "Displays a green tick badge icon with tooltip showing 'Artist', supporting small, medium, and large sizes.",
  "frontend/src/components/Header.tsx": "Application header with authentication controls (login/logout), theme toggle (dark/light), and displays the logged-in artist's profile with verification badge.",
  "frontend/src/components/PodcastEpisodeForm.tsx": "Form component for creating podcast episodes with fields for metadata, season/episode numbers, content flags, and file uploads (thumbnail, artwork, media). Includes submission blocking checks and upload progress tracking.",
  "frontend/src/components/PodcastShowForm.tsx": "Form component for creating podcast shows with fields for title, description, type, category, language, and artwork upload. Includes submission blocking checks and upload progress tracking.",
  "frontend/src/components/PricingSection.tsx": "Displays subscription plans in a grid layout with pricing, benefits, and a button to redirect users to purchase each plan. Fetches plans via useGetAllSubscriptionPlans hook and shows a loading spinner while data is being retrieved.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal form that prompts new users to enter their name during initial profile setup. Submits the name along with default category (generalArtist) using the useSaveCallerUserProfile mutation.",
  "frontend/src/components/SongSubmissionForm.tsx": "A comprehensive form for submitting songs/albums with fields for metadata (title, genre, language, release date), file uploads (artwork with 3000×3000 validation, audio), artist selection, album tracks editor, and legal agreements. Handles file upload progress, validation, and submission via useSubmitSong hook.",
  "frontend/src/components/StripeConfigurationModal.tsx": "Empty file with no content.",
  "frontend/src/components/SubscriptionSection.tsx": "Empty file with no content.",
  "frontend/src/components/SupportRequestsList.tsx": "Empty file with no content.",
  "frontend/src/components/UserAnalysisPanel.tsx": "Displays monthly listener statistics for all live songs owned by the user. Shows a grid of song cards with their listener count history sorted by year and month, or empty states when no data is available.",
  "frontend/src/components/UserArtistProfilesManager.tsx": "Manages user's artist profiles with create, edit, and delete functionality. Displays profile cards showing stage name, verification status, profile photo, and social media links with action buttons for each profile.",
  "frontend/src/components/UserEditSubmissionDialog.tsx": "A dialog form for editing existing song submissions with pre-populated fields including metadata, artist selections, and optional file replacements for artwork and audio. Matches artist names to profile IDs and handles album track editing for album-type releases.",
  "frontend/src/components/UserEditVideoDialog.tsx": "Dialog component for editing video submissions with form fields for title, description, category, tags, and file uploads (thumbnail, artwork, video), including upload progress tracking and validation.",
  "frontend/src/components/UserPodcastSubmissionSection.tsx": "Tabbed interface for managing podcast shows and episodes, displaying user's podcast shows with moderation status badges and providing forms to create new shows or add episodes.",
  "frontend/src/components/UserSubmissionsList.tsx": "Displays a list of user's music submissions with status badges, artwork thumbnails, metadata, and edit functionality for draft/pending/rejected submissions.",
  "frontend/src/components/UserVideoSubmissionSection.tsx": "Shows user's video submissions with thumbnails, descriptions, categories, tags, status badges, and edit functionality for pending/rejected videos.",
  "frontend/src/components/VerificationBenefitsPopup.tsx": "Empty file with no content.",
  "frontend/src/components/VerificationBenefitsSection.tsx": "Card component promoting verified artist program with benefits list (blue badge, priority distribution, faster approval, premium support) and ₹200/month pricing with apply button.",
  "frontend/src/components/VerificationPromotionPopup.tsx": "Empty file with no content.",
  "frontend/src/components/VerificationRenewalSection.tsx": "Card component prompting expired verified artists to renew their subscription, listing missed benefits and providing a renewal button with ₹200/month pricing.",
  "frontend/src/components/VerifiedBadge.tsx": "Reusable verified badge component displaying a blue tick icon with tooltip, supporting small/medium/large sizes and using optimized image assets.",
  "frontend/src/components/VideoSubmissionForm.tsx": "React form component for submitting video content with title, description, category, tags, thumbnail, artwork, and video file uploads, including progress tracking and validation.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, initializing access control and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profiles, admin checks, subscription plans, and video submissions with mutations and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components using oklch color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabbed interface for managing artists, song submissions, podcasts, videos, verification, monthly listeners, users, and subscription plans.",
  "frontend/src/pages/BlogPage.tsx": "Empty component file for blog page (not yet implemented).",
  "frontend/src/pages/BlogPostPage.tsx": "Empty component file for individual blog post page (not yet implemented).",
  "frontend/src/pages/CommunityPage.tsx": "Empty component file for community page (not yet implemented).",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, features showcase, and pricing section that handles authentication and redirects users to admin or user dashboard based on role.",
  "frontend/src/pages/PaymentCancel.tsx": "Empty component file for payment cancellation page (not yet implemented).",
  "frontend/src/pages/PaymentSuccess.tsx": "Empty component file for payment success page (not yet implemented).",
  "frontend/src/pages/TeamDashboard.tsx": "Empty component file for team dashboard page (not yet implemented).",
  "frontend/src/pages/ThankYouPage.tsx": "Displays a success confirmation page after song submission with a button to navigate to the user dashboard.",
  "frontend/src/pages/UserDashboard.tsx": "Main user dashboard with tabs for artist profiles, song submission, submissions list, podcast, video submissions, and analysis panels.",
  "frontend/src/pages/VerificationSubscriptionPage.tsx": "Empty file placeholder for verification subscription page functionality.",
  "frontend/src/utils/downloadExternalBlob.ts": "Utility function to download ExternalBlob objects by fetching bytes and triggering browser download with specified filename.",
  "frontend/src/utils/fileToExternalBlob.ts": "Converts browser File or Blob objects to ExternalBlob format for backend upload with optional progress tracking.",
  "frontend/src/utils/isValidUrl.ts": "Simple URL validation utility that checks if a string starts with http:// or https://.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter parsing utilities supporting both regular query strings and hash-based routing with sessionStorage persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting video submission platform features, subscription plan management, known build issues, and pending feature requests."
}