{
  "backend/main.mo": "Defines the main canister actor with types for song submissions, metadata, statuses, presave links, and editing workflows.",
  "backend/migration.mo": "Adds an isVerified field to artist profiles by migrating old artist profile records to the new schema.",
  "feature_evidence.json": "Lists feature evidence records linking feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains human‑written summaries of numerous frontend files including components, pages, and hooks.",
  "frontend/DEPLOYMENT.md": "Documents a deployment failure fix, configuration setup, actor initialization updates, and restoration of draft song‑submission features.",
  "frontend/index.css": "Defines global Tailwind-based styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point configuring the root element, favicon, viewport, and script loader for the frontend app.",
  "frontend/src/App.tsx": "Sets up routing, theme provider, authentication handling, actor initialization, and conditional profile setup flow.",
  "frontend/src/components/AdminAnnouncementSection.tsx": "Empty component file placeholder for an admin announcements section.",
  "frontend/src/components/AdminArtistManagement.tsx": "Displays and filters artist profiles, with options to edit or delete them using admin actions.",
  "frontend/src/components/AdminBlogManagement.tsx": "Empty component file.",
  "frontend/src/components/AdminEditArtistDialog.tsx": "Dialog for editing an artist profile, supporting photo uploads, form fields, and profile updates.",
  "frontend/src/components/AdminEditSubmissionDialog.tsx": "Dialog for editing a song submission, including metadata, artwork and audio uploads, and album track handling.",
  "frontend/src/components/AdminFeeManagement.tsx": "Empty component file.",
  "frontend/src/components/AdminMonthlyListenersManagement.tsx": "Allows admins to view and update monthly listener stats for songs, including adding and validating entries.",
  "frontend/src/components/AdminPodcastSubmissions.tsx": "Manages podcast show and episode submissions, providing approval, rejection, live marking, and file downloads.",
  "frontend/src/components/AdminProfileEditingControl.tsx": "Empty component file.",
  "frontend/src/components/AdminStats.tsx": "Empty component file.",
  "frontend/src/components/AdminSubmissionsList.tsx": "Admin interface to view, sort, update, and manage song submissions, including status changes, remarks, live URL handling, and deletion.",
  "frontend/src/components/AdminSupportRequestsManagement.tsx": "Empty placeholder component for managing support requests.",
  "frontend/src/components/AdminTeamManagement.tsx": "Allows admins to generate and copy team invite codes, showing unused codes and creation dates.",
  "frontend/src/components/AdminUserRoleManagement.tsx": "Empty placeholder component for managing user roles.",
  "frontend/src/components/AdminVerificationList.tsx": "Displays verification requests, lets admins approve, reject, or extend verification, and highlights pending counts.",
  "frontend/src/components/AdminVerificationManagement.tsx": "Empty placeholder component for verification management.",
  "frontend/src/components/AdminVerificationRequests.tsx": "Empty placeholder component for viewing verification requests.",
  "frontend/src/components/AlbumTracksEditor.tsx": "UI for adding, editing, and removing album tracks, including audio upload with progress tracking.",
  "frontend/src/components/AnnouncementPopup.tsx": "Empty placeholder component for announcements.",
  "frontend/src/components/ArtistNameWithVerified.tsx": "Shows an artist name with either a verified or green badge based on verification status.",
  "frontend/src/components/ArtistSetupForm.tsx": "Form for creating or editing an artist profile, including photo upload and social/media links.",
  "frontend/src/components/ClaimYouTubeCopyrightDialog.tsx": "Empty placeholder component for YouTube copyright claims.",
  "frontend/src/components/ConnectInstagramProfileDialog.tsx": "Empty placeholder component for Instagram profile linking.",
  "frontend/src/components/DashboardPublishedBlogList.tsx": "Empty placeholder component for listing published blogs.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with copyright text and support email link.",
  "frontend/src/components/GeneralSupportTab.tsx": "Empty placeholder component for general support UI.",
  "frontend/src/components/GreenBadge.tsx": "Displays a small green badge icon with tooltip, indicating an artist status.",
  "frontend/src/components/Header.tsx": "Renders the main header with theme toggle, auth controls, and artist profile display using Internet Identity.",
  "frontend/src/components/PodcastEpisodeForm.tsx": "Form for creating podcast episodes with file uploads, metadata fields, and progress tracking.",
  "frontend/src/components/PodcastShowForm.tsx": "Form to create a podcast show including metadata selection and artwork upload.",
  "frontend/src/components/ProfileSetupModal.tsx": "Simple modal prompting the user to save their display name via profile setup.",
  "frontend/src/components/SongSubmissionForm.tsx": "Comprehensive song submission form handling metadata, artist assignment, file uploads, and artwork validation.",
  "frontend/src/components/StripeConfigurationModal.tsx": "Empty component file.",
  "frontend/src/components/SubscriptionSection.tsx": "Empty component file.",
  "frontend/src/components/SupportRequestsList.tsx": "Empty component file.",
  "frontend/src/components/UserAnalysisPanel.tsx": "Displays analytics for the user's live songs, including listener stats or placeholders when none exist.",
  "frontend/src/components/UserArtistProfilesManager.tsx": "Manages display, creation, editing, and deletion of a user's artist profiles with dialogs and profile cards.",
  "frontend/src/components/UserEditSubmissionDialog.tsx": "Dialog for editing song submissions, handling metadata updates, file uploads, and artist selection.",
  "frontend/src/components/UserPodcastSubmissionSection.tsx": "Interface for managing podcast shows and episodes, including viewing, creating, and loading related items.",
  "frontend/src/components/UserSubmissionsList.tsx": "Displays the user's song submissions with status badges and supports opening an edit dialog.",
  "frontend/src/components/VerificationBenefitsPopup.tsx": "Empty file.",
  "frontend/src/components/VerificationBenefitsSection.tsx": "Shows benefits of becoming a verified artist and provides an option to apply for verification.",
  "frontend/src/components/VerificationPromotionPopup.tsx": "Empty file.",
  "frontend/src/components/VerificationRenewalSection.tsx": "Displays renewal UI for expired verified artist status and allows resubmitting for verification.",
  "frontend/src/components/VerifiedBadge.tsx": "Renders a verified badge image with tooltip support in multiple size options.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing on identity change and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for managing Internet Identity login, stored identities, and auth client configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting, editing, fetching, and administering song and podcast data through the backend actor.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and defines light and dark theme CSS variables for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders admin-only tabs for managing artists, submissions, podcasts, verification, and listener stats with access control.",
  "frontend/src/pages/BlogPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/BlogPostPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/CommunityPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with login flow and conditional navigation to admin or user dashboards.",
  "frontend/src/pages/PaymentCancel.tsx": "Empty placeholder page component.",
  "frontend/src/pages/PaymentSuccess.tsx": "Empty placeholder page component.",
  "frontend/src/pages/TeamDashboard.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ThankYouPage.tsx": "Displays a confirmation message after submission with a button to return to the user dashboard.",
  "frontend/src/pages/UserDashboard.tsx": "Implements a tabbed user dashboard with sections for profiles, submissions, podcasts, verification info, and analytics.",
  "frontend/src/pages/VerificationSubscriptionPage.tsx": "Empty file with no implementation.",
  "frontend/src/utils/downloadExternalBlob.ts": "Provides a helper to fetch bytes from an ExternalBlob and trigger a file download in the browser.",
  "frontend/src/utils/fileToExternalBlob.ts": "Converts a File or Blob into an ExternalBlob, optionally attaching upload progress tracking.",
  "frontend/src/utils/isValidUrl.ts": "Checks whether a string is a non-empty URL starting with http or https.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, container settings, animations, and plugins.",
  "project_state.json": "Project state file describing the app’s purpose, feature requirements, verification workflow, and asset rules."
}