{
  "backend/main.mo": "Main backend actor defining types and structures for songs, podcasts, profiles, verification, blog posts, and community messages, importing multiple modules and exposing the migration hook.",
  "backend/migration.mo": "Defines data structures for old and new actor states and handles migration logic for submissions, profiles, podcasts, and configuration data.",
  "feature_evidence.json": "Lists implemented features with associated file paths, components, test IDs, and confidence for feature verification.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their functionality across UI, forms, hooks, and dashboards.",
  "frontend/DEPLOYMENT.md": "Documents deployment issues, fixes, and verification steps related to missing config and actor initialization behavior.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styles.",
  "frontend/index.html": "HTML entry point loading the React app with favicon and root element.",
  "frontend/src/App.tsx": "Sets up React app routing, auth checks, and conditional rendering of dashboards and setup flows based on user state.",
  "frontend/src/components/AdminAnnouncementSection.tsx": "Provides UI for admins to view, edit, and save a global announcement message.",
  "frontend/src/components/AdminArtistManagement.tsx": "Displays searchable artist list with badge status and supports opening an edit dialog for each artist.",
  "frontend/src/components/AdminBlogManagement.tsx": "Handles creating, editing, publishing, and deleting blog posts with optional media uploads.",
  "frontend/src/components/AdminEditArtistDialog.tsx": "Dialog for admins to edit an artist’s profile, including updating photos and social links.",
  "frontend/src/components/AdminEditSubmissionDialog.tsx": "Dialog allowing admins to edit song submissions, update metadata, and replace artwork or audio files.",
  "frontend/src/components/AdminFeeManagement.tsx": "UI for viewing and updating distribution and annual maintenance fees, with form inputs and save actions.",
  "frontend/src/components/AdminPodcastSubmissions.tsx": "Lists all podcast shows and episodes with artwork, metadata, and file download handling for admins.",
  "frontend/src/components/AdminProfileEditingControl.tsx": "Admin toggle to enable or disable artist profile editing, showing current status and related rules.",
  "frontend/src/components/AdminStats.tsx": "Fetches submission data and displays summary statistics for total, approved, pending, and rejected items.",
  "frontend/src/components/AdminSubmissionsList.tsx": "Admin interface for reviewing, updating, commenting on, downloading assets from, and managing song submissions.",
  "frontend/src/components/AdminTeamManagement.tsx": "Manages team invite codes, allowing generation, viewing unused codes, and copying invite links.",
  "frontend/src/components/AdminUserRoleManagement.tsx": "Manages user roles with search, upgrade/downgrade actions, and user deletion UI using team member and artist data.",
  "frontend/src/components/AdminVerificationManagement.tsx": "Displays and updates verification requests, including status changes and expiry-day adjustments for each request.",
  "frontend/src/components/AdminVerificationRequests.tsx": "Empty placeholder component file with no implemented logic.",
  "frontend/src/components/AnnouncementPopup.tsx": "Shows a popup announcement fetched from the backend, only once per session, with dismiss handling.",
  "frontend/src/components/ArtistSetupForm.tsx": "Form for creating or editing an artist profile with photo upload, social links, and editing restrictions.",
  "frontend/src/components/DashboardPublishedBlogList.tsx": "Fetches and displays a list of published blog posts with media, dates, and content previews.",
  "frontend/src/components/Footer.tsx": "Static footer showing copyright text and a support email link.",
  "frontend/src/components/GreenBadge.tsx": "Renders a green badge image with tooltip, customizable by size.",
  "frontend/src/components/Header.tsx": "Main header with login/logout, navigation, theme toggle, and user display info with badges.",
  "frontend/src/components/PodcastEpisodeForm.tsx": "Form component for creating podcast episodes with file uploads, validation, and progress tracking.",
  "frontend/src/components/PodcastShowForm.tsx": "Form for creating podcast shows, handling artwork upload, metadata fields, and submission via API.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their display name on first setup.",
  "frontend/src/components/SongSubmissionForm.tsx": "Comprehensive form for uploading a song with metadata, artwork and audio files, fee agreement, and progress tracking.",
  "frontend/src/components/StripeConfigurationModal.tsx": "Empty file placeholder for a Stripe configuration modal.",
  "frontend/src/components/SubscriptionSection.tsx": "Empty file placeholder for a subscription UI section.",
  "frontend/src/components/UserEditSubmissionDialog.tsx": "Dialog allowing users to edit an existing song submission, including replacing artwork or audio and updating metadata.",
  "frontend/src/components/UserPodcastSubmissionSection.tsx": "Section managing podcast shows and episodes, allowing creation of shows and adding episodes with tabbed navigation.",
  "frontend/src/components/UserSubmissionsList.tsx": "Displays the user's song submissions with status badges and edit options, fetching data via hooks. Handles loading, empty states, and opens an edit dialog for editable submissions.",
  "frontend/src/components/VerificationBenefitsPopup.tsx": "Shows a one-time popup highlighting verification benefits to unverified users, with navigation to the verification subscription page.",
  "frontend/src/components/VerificationPromotionPopup.tsx": "Empty placeholder component file.",
  "frontend/src/components/VerifiedBadge.tsx": "Renders a verified artist badge image with a tooltip, supporting multiple sizes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, logout, status tracking, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for song submissions, profiles, and other backend interactions, with mutation success/error handling and cache invalidation.",
  "frontend/src/index.css": "Tailwind base configuration defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders a multi-tab admin dashboard with sections for stats, submissions, artists, verification, roles, fees, announcements, blog, team, and podcasts.",
  "frontend/src/pages/BlogPage.tsx": "Fetches and displays published blog posts with media, dates, and content, showing a loader or empty state when needed.",
  "frontend/src/pages/CommunityPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/LandingPage.tsx": "Displays the landing page with branding, a login button, and feature highlight cards.",
  "frontend/src/pages/PaymentCancel.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/PaymentSuccess.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/TeamDashboard.tsx": "Provides a limited-access team dashboard with tabs for overview, submissions, and artist viewing, plus permission info.",
  "frontend/src/pages/ThankYouPage.tsx": "Shows a confirmation card after submission with a button returning to the dashboard.",
  "frontend/src/pages/UserDashboard.tsx": "User dashboard with tabs for submissions, profile, verification, blogs, and podcasts, integrating profile state and verification workflows.",
  "frontend/src/pages/VerificationSubscriptionPage.tsx": "React page that displays verification status, pricing, and benefits, and lets users apply for verification via query hooks.",
  "frontend/src/utils/downloadExternalBlob.ts": "Utility to fetch bytes from an ExternalBlob and trigger a browser file download.",
  "frontend/src/utils/fileToExternalBlob.ts": "Converts a File or Blob into an ExternalBlob and optionally attaches upload progress handling.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters with sessionStorage support and hash routing compatibility.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing podcast workflow features, requirements, and pending feature requests."
}