{
  "backend/main.mo": "Defines backend actor types for songs, profiles, verification, blog posts, community messages, and related inputs with numerous imports for storage, access control, migration, and external services.",
  "backend/migration.mo": "Implements migration logic converting old actor state structures to a new state format while preserving stored maps and configuration fields.",
  "feature_evidence.json": "Lists feature evidence for recent build‑fix and redeploy tasks, referencing affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files including components, pages, hooks, and their behaviors.",
  "frontend/DEPLOYMENT.md": "Documentation explaining the root cause of deployment failures and detailing configuration fixes, file additions, and verification steps.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and applying global styling rules.",
  "frontend/index.html": "Base HTML entrypoint containing root div and script tag loading the frontend application.",
  "frontend/src/App.tsx": "Sets up the app’s router, query client, theme, and authentication-driven content flow, including loading states and profile/artist setup logic.",
  "frontend/src/components/AdminAnnouncementSection.tsx": "Provides an admin UI to view, edit, and save a global announcement displayed to all users.",
  "frontend/src/components/AdminArtistManagement.tsx": "Displays searchable artist profiles with badge status and allows admins to open an edit dialog for each artist.",
  "frontend/src/components/AdminBlogManagement.tsx": "Enables admins to create, edit, publish, and delete blog posts with optional media uploads.",
  "frontend/src/components/AdminEditArtistDialog.tsx": "Dialog for admins to edit an artist’s profile details and profile photo with upload progress handling.",
  "frontend/src/components/AdminEditSubmissionDialog.tsx": "Dialog for admins to edit song submission metadata and replace artwork or audio files with upload tracking.",
  "frontend/src/components/AdminFeeManagement.tsx": "UI for viewing and updating distribution and annual maintenance fees, including input fields and save actions tied to query hooks.",
  "frontend/src/components/AdminProfileEditingControl.tsx": "Controls whether users can edit artist profiles, with a toggle synced to backend state and explanatory UI.",
  "frontend/src/components/AdminStats.tsx": "Displays submission statistics by status, computing totals and percentages using fetched submission data.",
  "frontend/src/components/AdminSubmissionsList.tsx": "Admin interface for viewing, moderating, editing, commenting, and downloading assets for all song submissions.",
  "frontend/src/components/AdminTeamManagement.tsx": "Manages team invite codes, allowing generation, viewing unused codes, and copying invite links.",
  "frontend/src/components/AdminUserRoleManagement.tsx": "Manages user roles, enabling upgrades to team members, downgrades, user deletion, and searching through user profiles.",
  "frontend/src/components/AdminVerificationManagement.tsx": "Admin interface for viewing verification requests, updating statuses, and extending badge expiry with filtering and badge-validity logic.",
  "frontend/src/components/AdminVerificationRequests.tsx": "Empty file with no implementation.",
  "frontend/src/components/AnnouncementPopup.tsx": "Displays an announcement popup when a new message is fetched, using sessionStorage to avoid repeated showing.",
  "frontend/src/components/ArtistSetupForm.tsx": "Form for creating or editing an artist profile, including photo upload, social links, and validation with mutation hooks.",
  "frontend/src/components/DashboardPublishedBlogList.tsx": "Loads and displays published blog posts with media preview, timestamps, and fallback states for loading or empty lists.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright text and a support email link.",
  "frontend/src/components/GreenBadge.tsx": "Renders a green badge image with configurable size and a tooltip labeled 'Artist'.",
  "frontend/src/components/Header.tsx": "Main site header handling authentication, navigation, theme toggling, and user display including badges and roles.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name before proceeding.",
  "frontend/src/components/SongSubmissionForm.tsx": "Form component for submitting songs, handling file uploads, metadata inputs, fees, and final submission via mutation.",
  "frontend/src/components/StripeConfigurationModal.tsx": "Empty file placeholder for a Stripe configuration modal.",
  "frontend/src/components/SubscriptionSection.tsx": "Empty file placeholder for a subscription UI section.",
  "frontend/src/components/UserEditSubmissionDialog.tsx": "Dialog allowing users to edit song submissions, including metadata and optional artwork/audio reuploads.",
  "frontend/src/components/UserSubmissionsList.tsx": "Displays a list of user song submissions with status badges and edit options, loading user data via queries.",
  "frontend/src/components/VerificationBenefitsPopup.tsx": "Popup shown to unverified users explaining verification benefits and linking to the subscription page.",
  "frontend/src/components/VerificationPromotionPopup.tsx": "Empty file placeholder for a verification promotion popup.",
  "frontend/src/components/VerifiedBadge.tsx": "Renders a verified badge icon with a tooltip and size options.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout helpers, and persistent identity handling via context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user, artist, blog, and other platform data with mutation support and toast notifications.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark mode CSS variables and applying global styles.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up QueryClientProvider, and wraps the app with InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard UI with tabbed navigation for managing submissions, artists, verification, roles, fees, announcements, blog, and settings.",
  "frontend/src/pages/BlogPage.tsx": "Displays published blog posts with loading state, media previews, dates, and styled content.",
  "frontend/src/pages/CommunityPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page highlighting platform features and offering Internet Identity login.",
  "frontend/src/pages/PaymentCancel.tsx": "Empty placeholder page for payment cancellation.",
  "frontend/src/pages/PaymentSuccess.tsx": "Empty placeholder page for payment success.",
  "frontend/src/pages/TeamDashboard.tsx": "Team member dashboard allowing limited review of submissions and viewing of artist profiles through tabbed sections.",
  "frontend/src/pages/ThankYouPage.tsx": "Thank-you screen confirming song submission and offering navigation back to the dashboard.",
  "frontend/src/pages/UserDashboard.tsx": "Dashboard page managing artist profile state, music submissions, verification flow, and navigation with multiple UI components and dialogs.",
  "frontend/src/pages/VerificationSubscriptionPage.tsx": "Displays verification subscription details, handles verification application, and shows status-based UI states.",
  "frontend/src/utils/downloadExternalBlob.ts": "Utility to fetch bytes from an ExternalBlob and trigger a browser download using a generated object URL.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session-stored parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, container settings, animations, and registering plugins.",
  "project_state.json": "Project metadata tracking state, issues, and required features related to fixing deployment and redeploying the app."
}