{
  "backend/main.mo": "Defines the backend actor with types for song submissions, metadata, album tracks, ACR results, and editing/presave structures, serving as the core domain model for music submission workflows.",
  "backend/migration.mo": "Contains type definitions for historical data migration including songs, verification requests, news posts, community messages, podcasts, and artist profiles.",
  "feature_evidence.json": "Lists feature evidence entries mapping implemented features to frontend files, components, and test IDs for verification tracking.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend source files describing their functionality and recent feature additions.",
  "frontend/DEPLOYMENT.md": "Documents the root cause of a deployment failure and details the fixes made to configuration, actor initialization, routing, and restored song submission features.",
  "frontend/index.css": "Defines global Tailwind-based styling with custom OKLCH color variables for both light and dark themes.",
  "frontend/index.html": "Basic HTML entry point setting page metadata, favicon, root div, and loading the main frontend script.",
  "frontend/src/App.tsx": "Sets up the app’s router, theme, query client, and authentication flow, showing loading states and profile setup when needed.",
  "frontend/src/components/AdminAnnouncementSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminArtistManagement.tsx": "Displays and filters artist profiles for admins, with editing controls and profile detail cards.",
  "frontend/src/components/AdminBlogManagement.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminEditArtistDialog.tsx": "Modal dialog for admins to edit artist profiles, including photo upload with progress tracking.",
  "frontend/src/components/AdminEditSubmissionDialog.tsx": "Modal dialog allowing admins to edit song submissions, validate artwork, upload files, and update metadata.",
  "frontend/src/components/AdminFeeManagement.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminPodcastSubmissions.tsx": "Manages podcast and episode submissions, providing approval, rejection, live status updates, and file downloads.",
  "frontend/src/components/AdminProfileEditingControl.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminStats.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminSubmissionsList.tsx": "Displays and manages all song submissions for admins, supporting sorting, status updates, editing, deletion, and live URL handling.",
  "frontend/src/components/AdminSupportRequestsManagement.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminTeamManagement.tsx": "Renders an admin interface for generating, viewing, and copying unused invite codes. Supports code creation, clipboard copy, and displays creation dates.",
  "frontend/src/components/AdminUserRoleManagement.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/AdminVerificationList.tsx": "Displays and manages verification requests, including approving, rejecting, activating artists, and extending expiry. Shows status badges, alerts, and action controls for each request.",
  "frontend/src/components/AdminVerificationManagement.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/AdminVerificationRequests.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/AlbumTracksEditor.tsx": "Allows adding, editing, and removing album tracks with metadata and audio uploads. Supports upload progress, file conversion, and track list updates.",
  "frontend/src/components/AnnouncementPopup.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/ArtistSetupForm.tsx": "Manages artist profile creation and editing with photo upload, social links, validation, and permission checks. Handles upload progress and conditional field visibility.",
  "frontend/src/components/ClaimYouTubeCopyrightDialog.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/ConnectInstagramProfileDialog.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/DashboardPublishedBlogList.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with copyright text and a support email link.",
  "frontend/src/components/GeneralSupportTab.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/GreenBadge.tsx": "Displays a green badge icon with tooltip labeling the user as an artist. Supports configurable sizing.",
  "frontend/src/components/Header.tsx": "Renders the main site header with login/logout, theme toggle, and artist profile display. Integrates Internet Identity auth and profile querying.",
  "frontend/src/components/PodcastEpisodeForm.tsx": "Form component for creating podcast episodes, handling file uploads, metadata inputs, and submission via mutation hooks.",
  "frontend/src/components/PodcastShowForm.tsx": "Form for creating podcast shows with metadata fields and artwork upload, submitting via createShow mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Simple modal that collects and saves a user's name using a profile mutation.",
  "frontend/src/components/SongSubmissionForm.tsx": "Song submission form supporting artwork validation, audio upload, metadata entry, and album track management.",
  "frontend/src/components/StripeConfigurationModal.tsx": "Empty component file.",
  "frontend/src/components/SubscriptionSection.tsx": "Empty component file.",
  "frontend/src/components/SupportRequestsList.tsx": "Empty component file.",
  "frontend/src/components/UserArtistProfilesManager.tsx": "Displays and manages user artist profiles, including creation, editing, and deletion dialogs.",
  "frontend/src/components/UserEditSubmissionDialog.tsx": "Dialog for editing an existing song submission with metadata updates, file re-uploads, and artist matching.",
  "frontend/src/components/UserPodcastSubmissionSection.tsx": "UI section for users to view, create, and manage their podcast shows and episodes with tab navigation and episode loading.",
  "frontend/src/components/UserSubmissionsList.tsx": "Displays the user's song submissions with status badges and editing options, handling loading and empty states.",
  "frontend/src/components/VerificationBenefitsPopup.tsx": "Empty component file with no implementation.",
  "frontend/src/components/VerificationBenefitsSection.tsx": "Shows benefits of verified status and allows users to apply if not verified or pending, including loading handling.",
  "frontend/src/components/VerificationPromotionPopup.tsx": "Empty component file with no implementation.",
  "frontend/src/components/VerificationRenewalSection.tsx": "Displays renewal prompt and benefits list when a user's verified status is expired, with ability to submit renewal.",
  "frontend/src/components/VerifiedBadge.tsx": "Renders a verified badge icon with tooltip and configurable size.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and exposing identity state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for song submission, admin actions, user/admin retrieval, and mutation-side toasts with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with guarded access and tabs for artists, submissions, podcasts, and verification.",
  "frontend/src/pages/BlogPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/BlogPostPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/CommunityPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen with login handling and redirects to user or admin dashboards plus feature highlights.",
  "frontend/src/pages/PaymentCancel.tsx": "Empty placeholder page component.",
  "frontend/src/pages/PaymentSuccess.tsx": "Empty placeholder page component.",
  "frontend/src/pages/TeamDashboard.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ThankYouPage.tsx": "Displays a thank‑you message after submission and provides navigation back to the user dashboard.",
  "frontend/src/pages/UserDashboard.tsx": "User dashboard with tabs for profiles, song submissions, submission list, and podcast tools.",
  "frontend/src/pages/VerificationSubscriptionPage.tsx": "Empty placeholder page component.",
  "frontend/src/utils/downloadExternalBlob.ts": "Utility to fetch bytes from an ExternalBlob and trigger a browser download.",
  "frontend/src/utils/fileToExternalBlob.ts": "Converts a File or Blob into an ExternalBlob with optional upload progress tracking.",
  "frontend/src/utils/isValidUrl.ts": "Simple helper to validate URLs by checking http/https prefixes.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and syncing URL values with stored values, including hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, and container settings, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing the Verified Artist system, its requirements, features, and architectural notes for admin and user flows."
}