{
  "kind": "build_request",
  "title": "Fix admin login routing and restore admin privileges for yeetmusictamil@gmail.com",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore administrator recognition for the account associated with the email address \"yeetmusictamil@gmail.com\" so that this account is treated as an admin by the backend authorization layer (i.e., AccessControl.isAdmin returns true for that user’s Principal after they authenticate).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-6"
        ],
        "quotes": [
          "it direct me to user dashboard",
          "yeetmusictamil@gmail.com this is the email id"
        ]
      },
      "acceptanceCriteria": [
        "After the user logs in with Internet Identity using the account that owns/uses email \"yeetmusictamil@gmail.com\", backend calls guarded by admin checks (e.g., getAllSubmissionsForAdmin / getAllArtistProfilesForAdmin) succeed for that user.",
        "The backend exposes/keeps a reliable way to determine admin status for the caller (e.g., isCallerAdmin) and it returns true for the restored admin account.",
        "Admin status persists across canister upgrades; if an upgrade would otherwise drop the admin assignment, add conditional migration logic in backend/migration.mo to preserve/restore it."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix frontend post-login navigation so that admins are routed to \"/admin-dashboard\" instead of always being routed to \"/user-dashboard\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "it direct me to user dashboard"
        ]
      },
      "acceptanceCriteria": [
        "From the Landing Page, when the authenticated user is an admin, clicking the primary CTA (or any automatic post-login routing implemented) navigates to \"/admin-dashboard\".",
        "When the authenticated user is not an admin, navigation continues to go to \"/user-dashboard\".",
        "No changes are made to frontend immutable paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add frontend route protection for the Admin Dashboard page so that non-admin users who navigate to \"/admin-dashboard\" are redirected to \"/user-dashboard\" (and are shown a clear English error/toast message indicating they are not authorized).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "it direct me to user dashboard"
        ]
      },
      "acceptanceCriteria": [
        "If a non-admin user manually visits \"/admin-dashboard\", they are redirected to \"/user-dashboard\" and see an authorization error message in English.",
        "If an admin visits \"/admin-dashboard\", the page renders normally and admin data queries execute without authorization traps."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo changes if required for state upgrades.",
    "Do not edit any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths in SYSTEM_CONTEXT.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Implementing a new authentication provider (only Internet Identity is used).",
    "Adding new admin features beyond fixing admin recognition and routing.",
    "Adding external databases or third-party role-management services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}