{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend build/deploy configuration to restore successful deploy and runtime backend connectivity",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Identify and fix the frontend-side root cause preventing successful end-to-end build/deploy, and document the cause and minimal changes made.",
      "acceptanceCriteria": [
        "A clear root-cause summary is documented in the repo (e.g., in a short DEPLOYMENT.md note or similar) describing what failed and what was changed to fix it.",
        "`dfx deploy` (or the platform’s equivalent deploy step) completes successfully without errors for all canisters.",
        "Frontend production build completes successfully (TypeScript + bundler) with no build-stopping errors.",
        "Backend canister compiles successfully (Motoko) with no build-stopping errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config.ts",
          "operation": "create",
          "description": "Add the missing frontend configuration module required by existing imports (used by useActor/useInternetIdentity) to unblock TypeScript production builds. Implement minimal runtime config loading for canister IDs and agent host used by actor creation, using environment-driven values with safe fallbacks."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Harden actor creation so build/runtime do not fail when optional config values are missing or when admin secret initialization is unavailable. Ensure anonymous actor creation works reliably by default and avoid throwing on access-control initialization failures (log and continue)."
        },
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Ensure Internet Identity configuration reads from the shared config loader and uses deploy-safe defaults when environment variables are absent, preventing production builds from failing due to undefined configuration."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add minimal defensive handling so the app can render (at least the Landing page) even if backend actor/config initialization is still in progress or unavailable, preventing a build-time or runtime blank-screen scenario."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "create",
          "description": "Document the investigated deploy failure root cause and the minimal frontend changes applied (e.g., missing config module/import resolution, environment variable expectations for canister IDs/host), plus brief verification steps for successful build and deploy."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the deployed frontend loads and can communicate with the backend canister (anonymous access at minimum) without runtime errors.",
      "acceptanceCriteria": [
        "Opening the deployed app in a browser shows the Landing page without a blank screen.",
        "No critical runtime errors appear in the browser console on initial load.",
        "The frontend can successfully create an actor and complete at least one basic query call (e.g., fetch user/profile state) without failing due to canister ID / agent / CORS / host misconfiguration."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config.ts",
          "operation": "modify",
          "description": "Finalize deploy-safe runtime configuration resolution (backend canister ID + agent host/network) so the frontend can create an actor correctly in both local and deployed environments, supporting anonymous access at minimum."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Ensure actor creation uses the resolved deploy-time config and remains stable across route loads; keep behavior non-fatal on initialization steps so the app loads and queries can run without console-stopping errors."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/adjust one lightweight query hook intended for deploy verification (e.g., a safe call to getCallerUserProfile) so it can run anonymously without throwing, enabling confirmation that actor creation + basic query communication works."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Add minimal non-intrusive runtime error surface (e.g., a small warning area) if backend connectivity/config is missing, while still rendering the Landing page content so deployed loads never appear blank."
        }
      ]
    }
  ]
}