{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin-aware post-login routing and Admin Dashboard route protection",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Route authenticated admins to /admin-dashboard instead of always /user-dashboard after login/CTA.",
      "acceptanceCriteria": [
        "From the Landing Page, when the authenticated user is an admin, clicking the primary CTA (or any automatic post-login routing implemented) navigates to \"/admin-dashboard\".",
        "When the authenticated user is not an admin, navigation continues to go to \"/user-dashboard\".",
        "No changes are made to frontend immutable paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Update post-login CTA routing to branch by admin status: use the authorization component’s admin-check capability via the existing `useIsCurrentUserAdmin` hook (calls backend `isCallerAdmin`) to navigate admins to `/admin-dashboard` and non-admins to `/user-dashboard`. Handle the case where the user just logged in (identity becomes available after `login()`): implement a small redirect-intent state/effect so navigation occurs once the admin check query has resolved. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Protect /admin-dashboard so non-admin users are redirected to /user-dashboard with a clear English authorization message.",
      "acceptanceCriteria": [
        "If a non-admin user manually visits \"/admin-dashboard\", they are redirected to \"/user-dashboard\" and see an authorization error message in English.",
        "If an admin visits \"/admin-dashboard\", the page renders normally and admin data queries execute without authorization traps."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add an admin guard at the Admin Dashboard page level using the authorization component’s admin-check capability via `useIsCurrentUserAdmin`. While the admin check is loading, render a minimal loading state to avoid firing admin-only queries. If the resolved admin flag is false, trigger a Sonner toast with a clear English message (e.g., not authorized) and redirect to `/user-dashboard`. If true, render the existing admin tabs normally. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}