{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Retry subscription plans feature implementation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create admin interface for managing subscription plans with ability to add, edit, and delete plans including plan name, pricing, benefits list, and redirect URL",
      "acceptanceCriteria": [
        "Admin dashboard has a dedicated subscription plans management panel",
        "Admins can create new subscription plans with name, price, benefits, and redirect URL",
        "Admins can edit existing subscription plans",
        "Admins can delete subscription plans",
        "Changes persist in backend storage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminSubscriptionPlansManagement.tsx",
          "operation": "modify",
          "description": "Verify and enhance the existing AdminSubscriptionPlansManagement component to ensure complete CRUD functionality. The component already implements create, edit, and delete dialogs for subscription plans with fields for plan name, price per year (stored as bigint cents), benefits array, and redirect URL. Ensure all React Query hooks (useGetAllSubscriptionPlans, useCreateSubscriptionPlan, useUpdateSubscriptionPlan, useDeleteSubscriptionPlan) are properly integrated and error handling is implemented. Verify form validation for required fields (plan name, price, redirect URL) and that benefits can be added/removed dynamically. Use existing UI components from shadcn/ui (Dialog, Input, Button, Textarea) for consistency."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify that all subscription plan-related React Query hooks are present and correctly implemented: useGetAllSubscriptionPlans (query for fetching all plans), useCreateSubscriptionPlan (mutation for creating new plans), useUpdateSubscriptionPlan (mutation for updating existing plans), and useDeleteSubscriptionPlan (mutation for deleting plans). Ensure proper query invalidation on mutations to refresh the plans list after any CRUD operation. Verify error handling and loading states are properly exposed."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Verify that the AdminSubscriptionPlansManagement component is properly wired into the admin dashboard's tabbed interface. Ensure the subscription plans tab is accessible and labeled appropriately (e.g., 'Subscription Plans' or 'Plans'). Confirm the tab is positioned logically within the existing tabs (Artists, Song Submissions, Podcast Submissions, Video Submissions, Verification Requests, Monthly Listeners, Users). Use authorization component to ensure only admin users can access this tab."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Display all active subscription plans publicly on the landing page in the existing PricingSection component location",
      "acceptanceCriteria": [
        "Subscription plans are fetched from backend and displayed in PricingSection component",
        "Plans show name, pricing, benefits list, and call-to-action buttons",
        "Plans are visible to all visitors without authentication",
        "Display uses existing pricing section styling and layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PricingSection.tsx",
          "operation": "modify",
          "description": "Modify the PricingSection component to fetch subscription plans from the backend using the useGetAllSubscriptionPlans hook. Replace any hardcoded or placeholder pricing data with dynamically fetched plans. Display each plan in a card layout showing: plan name as the heading, price per year (convert from bigint cents to readable currency format, e.g., ₹X,XXX/year), benefits as a bulleted or checkmarked list, and a call-to-action button that redirects to the plan's redirect URL using window.location.href (not router navigation). Handle loading and error states gracefully. Ensure the component remains accessible to unauthenticated users (no login required). Maintain existing Tailwind CSS styling and responsive grid layout for consistency with the landing page design."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Verify that the PricingSection component is properly imported and rendered in the LandingPage. Ensure it is positioned appropriately within the page flow (typically after hero and features sections). Confirm that the section is visible to all visitors without requiring authentication. No changes should be needed if PricingSection is already present; this operation ensures proper wiring and placement."
        }
      ]
    }
  ]
}